Обработки/Reports/_АнализФинансовогоРезультатаПортфеляНарастающимИтогом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_АнализФинансовогоРезультатаПортфеляНарастающимИтогом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_АнализФинансовогоРезультатаПортфеляНарастающимИтогом/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация		= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.ШаблонExcel	= РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ШаблонExcel");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если РеквизитыОтчетаЗаполненыКорректно() = ЛОЖЬ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСессииСбораСтатистики = ЗарегистрироватьНовуюСессию();
	
	ДанныеОтчета = ПолучитьДанныеОтчета();
	
	ИмяФайлаШаблонаExcel = ПолучитьИмяВременногоФайла("xlsx");

	ШаблонExcel.Записать(ИмяФайлаШаблонаExcel);
	
	// создадим документ MS Excel на основании сохраненного шаблона
	Excel = Новый COMОбъект("Excel.Application");
	Excel.Visible = Ложь;
	
	Excel.Workbooks.Open(ИмяФайлаШаблонаExcel);
	Лист1 = Excel.WorkSheets(1);
	Лист1.Activate();

	Лист1.Cells(1, 1).Value = ДанныеОтчета.Заголовок;
	
	НомерСтроки = 7;
	МассивЯчеекДляСреднего = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеОтчета.ДанныеОтчета Цикл
		
		Если СтрокаДанных.Итог Тогда
			
			Если НомерСтроки > 7 Тогда
				Область = Лист1.Range(СтрШаблон("A%1:A%2", НомерСтроки - 7, НомерСтроки - 1));
				Область.EntireRow.Select();
				Область.EntireRow.Copy();
				Область.EntireRow.Insert();
			КонецЕсли;
			
			Лист1.Cells(НомерСтроки, 1).Value	= СтрокаДанных.ВидАктива;
			Лист1.Cells(НомерСтроки, 8).Value	= СтрокаДанных.Расходы;
			Лист1.Cells(НомерСтроки, 10).Value	= СтрокаДанных.ВознаграждениеУК;
			Лист1.Cells(НомерСтроки, 12).Value	= СтрокаДанных.СредняяСЧА;
			
			МассивЯчеекДляСреднего.Добавить(СтрШаблон("L%1", Формат(НомерСтроки, "ЧГ=0")));
			
		Иначе
			
			Лист1.Cells(НомерСтроки, 1).Value	= СтрокаДанных.ВидАктива;
			Лист1.Cells(НомерСтроки, 2).Value	= СтрокаДанных.НКДДивиденды;
			Лист1.Cells(НомерСтроки, 4).Value	= СтрокаДанных.ПереоценкаНереализованная;
			Лист1.Cells(НомерСтроки, 6).Value	= СтрокаДанных.ФинРезОтСделокИПогашений;
			Лист1.Cells(НомерСтроки, 8).Value	= СтрокаДанных.Комиссии;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Лист1.Cells(НомерСтроки, 12).FormulaLocal = СтрШаблон("=СРЗНАЧ(%1)", СтрСоединить(МассивЯчеекДляСреднего, ";"));
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблонаExcel);
	Исключение
	КонецПопытки;
	
	Лист1.Range("A7").Select();
	
	Excel.Visible = True;
	
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики);
	
КонецПроцедуры
	
#КонецОбласти

#Область ФормированиеОтчета

&НаСервере
Функция ПолучитьДанныеОтчета()
	
	ДанныеОтчета = Новый Структура;
	ДанныеОтчета.Вставить("Заголовок",  
		СтрШаблон("Анализ финансового результата портфеля %1 от %2 за %3 (нарастающим итогом)", 
			Отчет.СчетДоверительногоУправления.НомерДоговора,
			Формат(Отчет.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy"),
			ПредставлениеПериода(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания)));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода",							Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", 							Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 			Отчет.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СворачиватьДоходыРасходыОтРеализации", 	Ложь);
	Запрос.УстановитьПараметр("СворачиватьДоходыРасходыОтПереоценки", 	Ложь);
	
	РаботаСОтчетами.ДополнитьТекстЗапросаДляОтчетаОФинансовыхРезультатахВРазрезеАналитики(Запрос);
	
#Область ТекстЗапроса
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Порядок,
		|	""Акции"" КАК ВидАктива,
		|	Акции.Ссылка КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ВидыАктивов
		|ИЗ
		|	Справочник.Акции КАК Акции
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|				ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|					И РеквизитыЭмитентов.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация)
		|			ТОГДА 2
		|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|				ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|					И РеквизитыЭмитентов.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация)
		|			ТОГДА ""ГЦБ""
		|		КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|			ТОГДА ""Субъекты РФ""
		|		ИНАЧЕ ""Облигации РФ""
		|	КОНЕЦ,
		|	Облигации.Ссылка
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитентов
		|		ПО Облигации.Эмитент.ЮрФизЛицо = РеквизитыЭмитентов.ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	""Депозиты/МНО"",
		|	ДепозитныеВклады.Ссылка
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	""Депозиты/МНО"",
		|	БанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6,
		|	""РЕПО"",
		|	""сделки репо""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА РасходыПоСделкеОбороты.Сделка ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""сделки репо""
		|		ИНАЧЕ РасходыПоСделкеОбороты.ЦеннаяБумага
		|	КОНЕЦ КАК ВидАктива,
		|	СУММА(РасходыПоСделкеОбороты.СуммаОборот * КурсыВалют.Курс / КурсыВалют.Кратность) КАК Сумма
		|ПОМЕСТИТЬ _Комиссии
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК РасходыПоСделкеОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО РасходыПоСделкеОбороты.Валюта = КурсыВалют.Валюта
		|			И РасходыПоСделкеОбороты.Период = КурсыВалют.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА РасходыПоСделкеОбороты.Сделка ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА ""сделки репо""
		|		ИНАЧЕ РасходыПоСделкеОбороты.ЦеннаяБумага
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СРЕДНЕЕ(ФинансовыеПоказатели.Значение) КАК Значение
		|ПОМЕСТИТЬ _СредняяСЧА
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеКалендаря.Дата КАК Дата,
		|		МАКСИМУМ(ФинансовыеПоказатели.Период) КАК ДатаСЧА
		|	ИЗ
		|		РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ПО ДанныеКалендаря.Дата >= ФинансовыеПоказатели.Период
		|				И (ФинансовыеПоказатели.Организация = &Организация)
		|				И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|				И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|	ГДЕ
		|		ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДанныеКалендаря.Дата) КАК ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО ДанныеКалендаря.ДатаСЧА = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.СубъектАналитики = &СчетДоверительногоУправления)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.УслугиДоверительногоУправления)) КАК ВознаграждениеУК,
		|	-ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход * КурсыВалют.Курс / КурсыВалют.Кратность КАК Сумма
		|ПОМЕСТИТЬ _Расходы
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И НЕ ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Сделки))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО ЗадолженностиПоДенежнымСредствамОбороты.Валюта = КурсыВалют.Валюта
		|			И ЗадолженностиПоДенежнымСредствамОбороты.Период = КурсыВалют.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Итог,
		|	ВидыАктивов.Порядок КАК Порядок,
		|	ВидыАктивов.ВидАктива КАК ВидАктива,
		|	СУММА(Показатели.НКДДивиденды) КАК НКДДивиденды,
		|	СУММА(Показатели.ПереоценкаНереализованная) КАК ПереоценкаНереализованная,
		|	СУММА(Показатели.ФинРезОтСделокИПогашений) КАК ФинРезОтСделокИПогашений,
		|	СУММА(Показатели.Комиссии) КАК Комиссии
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_ВидыАктивов.Порядок КАК Порядок,
		|		_ВидыАктивов.ВидАктива КАК ВидАктива
		|	ИЗ
		|		_ВидыАктивов КАК _ВидыАктивов) КАК ВидыАктивов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ВидыАктивов.ВидАктива КАК ВидАктива,
		|			_ПроцентыКПолучению.ИтогоДоходы - _ПроцентыКПолучению.ИтогоРасходы КАК НКДДивиденды,
		|			0 КАК ПереоценкаНереализованная,
		|			0 КАК ФинРезОтСделокИПогашений,
		|			0 КАК Комиссии
		|		ИЗ
		|			_ВидыАктивов КАК _ВидыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ПроцентыКПолучению КАК _ПроцентыКПолучению
		|				ПО (_ВидыАктивов.ЦеннаяБумага = ВЫБОР
		|						КОГДА _ПроцентыКПолучению.Аналитика = ""сделки репо""
		|							ТОГДА _ПроцентыКПолучению.Аналитика
		|						ИНАЧЕ _ПроцентыКПолучению.АналитикаПроцентов
		|					КОНЕЦ)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ВидыАктивов.ВидАктива,
		|			0,
		|			_КорректировкаФинансовыхВложений.ИтогоДоходы - _КорректировкаФинансовыхВложений.ИтогоРасходы,
		|			0,
		|			0
		|		ИЗ
		|			_ВидыАктивов КАК _ВидыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _КорректировкаФинансовыхВложений КАК _КорректировкаФинансовыхВложений
		|				ПО _ВидыАктивов.ЦеннаяБумага = _КорректировкаФинансовыхВложений.Аналитика
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ВидыАктивов.ВидАктива,
		|			0,
		|			0,
		|			_ПродажаАктивов.ИтогоДоходы - _ПродажаАктивов.ИтогоРасходы,
		|			0
		|		ИЗ
		|			_ВидыАктивов КАК _ВидыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ПродажаАктивов КАК _ПродажаАктивов
		|				ПО _ВидыАктивов.ЦеннаяБумага = _ПродажаАктивов.Аналитика
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ВидыАктивов.ВидАктива,
		|			0,
		|			0,
		|			-_ПокупкаАктивов.ИтогоРасходы,
		|			0
		|		ИЗ
		|			_ВидыАктивов КАК _ВидыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ПокупкаАктивов КАК _ПокупкаАктивов
		|				ПО _ВидыАктивов.ЦеннаяБумага = _ПокупкаАктивов.Аналитика
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_ВидыАктивов.ВидАктива,
		|			ВЫБОР
		|				КОГДА _Комиссии.ВидАктива = ""сделки репо""
		|					ТОГДА _Комиссии.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			ВЫБОР
		|				КОГДА _Комиссии.ВидАктива <> ""сделки репо""
		|					ТОГДА _Комиссии.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			-_Комиссии.Сумма
		|		ИЗ
		|			_ВидыАктивов КАК _ВидыАктивов
		|				ЛЕВОЕ СОЕДИНЕНИЕ _Комиссии КАК _Комиссии
		|				ПО _ВидыАктивов.ЦеннаяБумага = _Комиссии.ВидАктива) КАК Показатели
		|		ПО ВидыАктивов.ВидАктива = Показатели.ВидАктива
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыАктивов.ВидАктива,
		|	ВидыАктивов.Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Итог,
		|	РАЗНОСТЬДАТ(&НачалоПериода, ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), МЕСЯЦ) КАК ВидАктива,
		|	СУММА(_ДанныеОтчета.НКДДивиденды) КАК НКДДивиденды,
		|	СУММА(_ДанныеОтчета.ПереоценкаНереализованная) КАК ПереоценкаНереализованная,
		|	СУММА(_ДанныеОтчета.ФинРезОтСделокИПогашений) КАК ФинРезОтСделокИПогашений,
		|	ЕСТЬNULL(Расходы.Сумма, 0) КАК Расходы,
		|	ЕСТЬNULL(ВознагражденияУК.Сумма, 0) КАК ВознаграждениеУК,
		|	_СредняяСЧА.Значение КАК СредняяСЧА
		|ПОМЕСТИТЬ _Итоги
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СредняяСЧА КАК _СредняяСЧА
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(_Расходы.Сумма) КАК Сумма
		|		ИЗ
		|			_Расходы КАК _Расходы
		|		ГДЕ
		|			_Расходы.ВознаграждениеУК = ЛОЖЬ) КАК Расходы
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(_Расходы.Сумма) КАК Сумма
		|		ИЗ
		|			_Расходы КАК _Расходы
		|		ГДЕ
		|			_Расходы.ВознаграждениеУК = ИСТИНА) КАК ВознагражденияУК
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СредняяСЧА.Значение,
		|	ЕСТЬNULL(Расходы.Сумма, 0),
		|	ЕСТЬNULL(ВознагражденияУК.Сумма, 0)";
#КонецОбласти

	КонецПериода = КонецМесяца(Отчет.Период.ДатаНачала);

	Пока КонецПериода <= Отчет.Период.ДатаОкончания Цикл
		
		СистемныеФункции.УдалитьТаблицыИзМенеджераВременныхТаблиц(Запрос);
		
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.Выполнить();
		
		ПоместитьТаблицуВДанныеОтчета(ДанныеОтчета, Запрос, "_Итоги",			"ДанныеОтчета");
		ПоместитьТаблицуВДанныеОтчета(ДанныеОтчета, Запрос, "_ДанныеОтчета",	"ДанныеОтчета", "Порядок");
		
		КонецПериода		= КонецМесяца(ДобавитьМесяц(КонецПериода, 1))
	КонецЦикла;
	
	Возврат ДанныеОтчета;

КонецФункции

&НаСервере
Процедура ПоместитьТаблицуВДанныеОтчета(ДанныеОтчета, Запрос, ИмяТаблицыЗапроса, ИмяТаблицыОтчета, Сортировка = "")
	
	Данные = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяТаблицыЗапроса).ПолучитьДанные().Выгрузить();
	
	Если ЗначениеЗаполнено(Сортировка) Тогда
		Данные.Сортировать(Сортировка);
	КонецЕсли;
	
	Если ДанныеОтчета.Свойство(ИмяТаблицыОтчета) Тогда
		МассивСтрок = ДанныеОтчета[ИмяТаблицыОтчета];
	Иначе
		МассивСтрок = Новый Массив;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из Данные Цикл
		ДанныеСтроки = Новый Структура;
		
		Для Каждого Колонка Из Данные.Колонки Цикл
			Значение = СериализоватьЗначение(СтрокаДанных[Колонка.Имя], СтрокаДанных, ИмяТаблицыЗапроса, Колонка.Имя);
			
			ДанныеСтроки.Вставить(Колонка.Имя, Значение);
		КонецЦикла;
		
		МассивСтрок.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	ДанныеОтчета.Вставить(ИмяТаблицыОтчета, МассивСтрок);
	
КонецПроцедуры

&НаСервере
Функция СериализоватьЗначение(Знач Значение, СтрокаДанных, ИмяТаблицы, ИмяКолонки)
	
	Если ИмяКолонки = "Сумма" Тогда
		Значение = Окр(Значение, 2);
		
	ИначеЕсли ИмяКолонки = "ВидАктива" И ИмяТаблицы = "_Итоги" Тогда
		Значение = СтрШаблон("ИТОГО за %1 мес.", Значение);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		//Примитивные типы не преобразовываем	
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Значение = НачалоДня(Значение);
		
	Иначе 
		Значение = Строка(Значение);
	
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции
	
#КонецОбласти

#Область ДополнительныеПроцедуры

&НаКлиенте
Функция РеквизитыОтчетаЗаполненыКорректно()
	
	Отказ = Ложь;
	
	ОбязательныеРеквизиты	= Новый Структура;
	
	ОбязательныеРеквизиты.Вставить("Организация",					"Организация");
	ОбязательныеРеквизиты.Вставить("СчетДоверительногоУправления",	"Счет доверительного управления");
	
	Для Каждого Реквизит Из ОбязательныеРеквизиты Цикл
		Если НЕ ЗначениеЗаполнено(Отчет[Реквизит.Ключ]) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """ + Реквизит.Значение + """ не заполнено",,, "Отчет." + Реквизит.Ключ, Отказ);
		КонецЕсли;
	КонецЦикла;

	СтрокаСообщений = "";
	Если НЕ ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, СтрокаСообщений) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщений,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область СтатистикаРаботыВнутреннихМеханизмов 

&НаСервере
Функция ЗарегистрироватьНовуюСессию()
	
	РеквизитФормыОтчет = РеквизитФормыВЗначение("Отчет");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыОтчет);
	
	Механизм = РеквизитФормыОтчет.Метаданные().ПолноеИмя();
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессииСбораСтатистики = Новый Структура;
	ПараметрыСессииСбораСтатистики.Вставить("Механизм", Механизм);
	ПараметрыСессииСбораСтатистики.Вставить("Сессия", 	Сессия);
		
	Возврат ПараметрыСессииСбораСтатистики;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПараметрыСессииСбораСтатистики.Механизм, ПараметрыСессииСбораСтатистики.Сессия);	
	
КонецПроцедуры
	
#КонецОбласти
